In [19]:
import pandas as pd
alunosDic = {'Nome':['Ricardo', 'Pedro', 'Roberto', 'Carlos'],
         'Nota':[4, 7, 5.5, 9],
         'Aprovado':['Não', 'Sim', 'Não', 'Sim']}

In [22]:
alunosDF = pd.DataFrame(alunosDic)

In [23]:
alunosDF

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não
3   Carlos   9.0      Sim

In [24]:
objeto1 = pd.Series([3, 5, 9, 10, 12])
print(objeto1)

0     3
1     5
2     9
3    10
4    12
dtype: int64

In [25]:
import numpy as np
array1 = np.array([3, 5, 9, 10, 12])
array2 = np.array([(3, 5, 9, 10, 12), (1, 2, 9, 4, 10)])
print(array1)
print(array2)

[ 3  5  9 10 12]
[[ 3  5  9 10 12]
 [ 1  2  9  4 10]]

In [26]:
objeto2 = pd.Series(array1)
print(objeto2)

0     3
1     5
2     9
3    10
4    12
dtype: int32

<h3> O comando pd.Series só pode ser utilizado em arrays unidimensionais

In [27]:
alunosDF

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não
3   Carlos   9.0      Sim

#### Explorando o dataframe

In [28]:
alunosDF.head()

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não
3   Carlos   9.0      Sim

In [29]:
alunosDF.shape # mostra o tamanho (linhas, colunas)

(4, 3)

In [30]:
alunosDF.describe()

           Nota
count  4.000000
mean   6.375000
std    2.136001
min    4.000000
25%    5.125000
50%    6.250000
75%    7.500000
max    9.000000

In [31]:
alunosDF

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não
3   Carlos   9.0      Sim

In [38]:
alunosDF['Nome']

0    Ricardo
1      Pedro
2    Roberto
3     Carlos
Name: Nome, dtype: object

In [46]:
alunosDF.loc[[2]] #slice

      Nome  Nota Aprovado
2  Roberto   5.5      Não

In [47]:
alunosDF.loc[0:2] #slicing from index 0 to 2

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não

In [48]:
alunosDF.loc[alunosDF['Nome']=='Pedro']

    Nome  Nota Aprovado
1  Pedro   7.0      Sim

In [49]:
alunosDF.loc[alunosDF['Nome']=='Carlos']

     Nome  Nota Aprovado
3  Carlos   9.0      Sim

In [50]:
alunosDF.loc[alunosDF['Nota'] >= 7]

     Nome  Nota Aprovado
1   Pedro   7.0      Sim
3  Carlos   9.0      Sim

In [54]:
alunosDF.loc[alunosDF['Nota'] < 7]

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
2  Roberto   5.5      Não

In [55]:
#Estatística dos alunos com nota inferior a 7.
alunosDF.loc[alunosDF['Nota'] < 7].describe()

          Nota
count  2.00000
mean   4.75000
std    1.06066
min    4.00000
25%    4.37500
50%    4.75000
75%    5.12500
max    5.50000

In [58]:
alunosDF.loc[alunosDF['Aprovado'] == 'Sim']

     Nome  Nota Aprovado
1   Pedro   7.0      Sim
3  Carlos   9.0      Sim

<hr>
<h1> manipulando linhas de dataframes

In [59]:
alunosDF

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não
3   Carlos   9.0      Sim

In [62]:
primeiraslinhas = alunosDF.loc[0:2]

In [63]:
primeiraslinhas

      Nome  Nota Aprovado
0  Ricardo   4.0      Não
1    Pedro   7.0      Sim
2  Roberto   5.5      Não